{
    "types": [
      {
        "id": 1,
        "type": "Balanced Type",
        "characteristics": [
            "일과 휴식의 균형을 가장 중요하게 여깁니다.",
            "성과를 내는 것이 중요하지만, 신체적, 정신적 피로를 최소화하며 지속적인 성장을 추구합니다.",
            "세부적인 계획보다는 유연한 목표 설정을 선호합니다."
        ],
        "routine_recommendations": [
            {
            "bold": "주간 계획 세우기",
            "content": "일일 스케줄보다는 주간 목표를 설정하고 해당 목표에 맞춰 일정을 조정합니다."
            },
            {
            "bold": "집중 시간과 휴식 시간 구분",
            "content": "아침에는 집중적으로 업무를 수행하고 오후에는 가벼운 일정을 유지합니다."
            },
            {
            "bold": "명확한 휴식 시간 설정",
            "content": "정기적인 휴식을 통해 번아웃을 예방합니다."
            },
            {
            "bold": "목표 재조정",
            "content": "주간 목표 달성 여부에 따라 다음 주 계획을 조정합니다."
            }
        ],
        "celebrity_example": {
            "name": "오프라 윈프리",
            "description": "성공한 방송인 겸 사업가로서 오프라 윈프리는 바쁜 일정 속에서도 정신적, 신체적 균형을 유지하는 데 큰 중요성을 두고 있습니다. 그녀는 명상과 휴식의 중요성을 자주 강조하며 지속 가능한 성취를 추구하는 대표적인 균형형 인물입니다.",
            "routine": [
            {
                "bold": "아침 명상",
                "content": "오프라는 매일 아침 20분간 명상을 하며 하루를 차분하게 준비합니다."
            },
            {
                "bold": "운동",
                "content": "아침 명상 후 가벼운 운동을 통해 몸을 깨웁니다. 건강 관리는 오프라의 삶에서 중요한 부분입니다."
            },
            {
                "bold": "일과 휴식의 분리",
                "content": "오프라는 일과 시간을 명확히 구분하며, 퇴근 후에는 휴식에 중점을 둡니다. 책을 읽거나 친구들과 교류하며 에너지를 충전합니다."
            },
            {
                "bold": "주말 리트릿",
                "content": "주말에는 자연 속에서 시간을 보내거나 명상 리트릿에 참여하여 일주일간 쌓인 피로를 풀고 내면의 균형을 되찾습니다."
            }
          ]
        }
      },
      {
        "id": 2,
        "type": "Perfectionist Type",
        "characteristics": [
            "모든 것을 완벽하게 해내려는 경향이 있습니다. 계획에서 벗어날 때 불안감을 느끼며, 세부 사항에 많은 주의를 기울입니다.",
            "세심하게 계획된 루틴에서 안정감을 찾습니다.",
            "예측할 수 없는 변수는 스트레스를 유발하며, 계획이 차질이 생기면 쉽게 좌절할 수 있습니다."
        ],
        "routine_recommendations": [
            {
            "bold": "세부적인 계획 수립",
            "content": "하루나 일주일 동안 시간대별로 세부적인 계획을 세웁니다."
            },
            {
            "bold": "일정 기록 및 체크리스트 사용",
            "content": "작은 성취를 시각적으로 확인할 수 있도록 체크리스트나 앱 사용을 권장합니다."
            },
            {
            "bold": "예측 가능한 변수 반영",
            "content": "예상치 못한 문제 해결을 위해 '여유 시간'을 확보하여 미리 계획합니다."
            },
            {
            "bold": "일정 평가 시간",
            "content": "매일 또는 매주 계획을 검토하고 수정하며 효율성을 평가합니다."
            }
        ],
        "celebrity_example": {
            "name": "스티브 잡스",
            "description": "애플의 창립자인 스티브 잡스는 세부 사항에 대한 완벽주의로 유명합니다. 그는 디자인, 사용자 경험, 제품 마감에 이르기까지 모든 것에 집착하며 최상의 결과를 추구했던 대표적인 완벽주의자입니다.",
            "routine": [
            {
                "bold": "간단한 아침 의식",
                "content": "스티브 잡스는 같은 옷을 입으며 불필요한 결정을 줄이고 중요한 일에 집중할 수 있었습니다."
            },
            {
                "bold": "철저한 일정 관리",
                "content": "일상 업무를 세부적으로 계획하고 중요한 회의나 개발 과정에서도 가장 작은 디테일을 놓치지 않았습니다."
            },
            {
                "bold": "집중 피드백 시간",
                "content": "스티브는 매일 디자인 및 개발 팀과 정기 회의를 열어 진도를 점검하고 개선이 필요한 부분을 지적했습니다."
            },
            {
                "bold": "산책을 통한 숙고",
                "content": "중요한 결정을 내릴 때 산책을 통해 머리를 맑게 한다고 전해집니다."
            }
          ]
        }
      },
      {
        "id": 3,
        "type": "Spontaneous Type",
        "characteristics": [
            "사전에 계획된 일정보다는 당시의 기분이나 상황에 따라 행동하는 것을 선호합니다.",
            "과도하게 정해진 루틴에 답답함을 느끼며, 자유롭고 유연한 스케줄을 선호합니다.",
            "쉽게 지루함을 느끼고 자주 변화를 원합니다."
        ],
        "routine_recommendations": [
            {
            "bold": "대규모 목표 설정",
            "content": "주 단위로 달성할 큰 목표를 설정하고 그 목표 내에서 자유롭게 일정을 조정합니다."
            },
            {
            "bold": "루틴 내 유연성",
            "content": "하루 업무 완료 ‘기한’만 설정하고, 특정 시간 배정은 그때의 기분에 맞게 조정합니다."
            },
            {
            "bold": "집중할 수 있는 환경 조성",
            "content": "자유로운 성향으로 인해 주변 환경에 큰 영향을 받을 수 있으므로, 집중하기 좋은 장소나 시간을 찾는 것이 중요합니다."
            },
            {
            "bold": "능동적 보상 시스템",
            "content": "목표를 달성했을 때 스스로에게 작은 보상을 주어 동기를 부여합니다."
            }
        ],
        "celebrity_example": {
            "name": "리처드 브랜슨",
            "description": "버진 그룹의 창립자인 리처드 브랜슨은 자발적이고 모험적인 성격으로 잘 알려져 있습니다. 그는 사전에 계획된 틀보다는 새로운 기회에 맞춰 변화를 추구하고 다양한 사업 분야에 도전하며 자유롭게 비즈니스를 운영합니다.",
            "routine": [
            {
                "bold": "5시 기상",
                "content": "리처드 브랜슨은 항상 같은 시간에 기상하지 않지만, 아침에 일찍 일어나는 습관을 중요하게 여깁니다. 아침에는 운동이나 서핑과 같은 활동을 즐깁니다."
            },
            {
                "bold": "자유로운 근무 시간",
                "content": "사무실에서 일하기보다는 다른 사람들과 소통하며 아이디어를 나누는 것을 선호합니다. 정해진 책상에서 일하기보다는 다양한 환경에서 일하는 자유를 즐깁니다."
            },
            {
                "bold": "이동 중 업무 처리",
                "content": "비행기나 기차에서 일을 처리하며, 여행 시간을 생산적으로 사용하는 즉흥적인 접근 방식을 채택합니다."
            },
            {
                "bold": "새로운 아이디어 탐구",
                "content": "정해진 근무 시간 대신, 아이디어가 떠오르면 팀과 공유하거나 새로운 프로젝트에 반영합니다. 계획보다는 기회가 생기면 즉시 실행하는 경향이 강합니다."
            }
          ]
        }
      },
      {
        "id": 4,
        "type": "Social Type",
        "characteristics": [
            "다른 사람들과의 상호작용을 통해 에너지를 얻지만, 혼자 있는 시간이 너무 길어지면 동기부여가 떨어집니다.",
            "팀 활동과 협업을 선호하며, 주변 사람들과 함께 일할 때 더 큰 성과를 냅니다."
        ],
        "routine_recommendations": [
            {
            "bold": "팀 활동 포함",
            "content": "업무와 학습을 팀 프로젝트, 스터디 그룹, 워크숍 형식으로 구성합니다. 온라인에서도 상호 피드백이 가능한 구조를 추천합니다."
            },
            {
            "bold": "사회적 상호작용 시간 포함",
            "content": "일상 또는 주간 일정에 동료와의 대화, 네트워킹 등 일정량의 상호작용 시간을 반드시 포함하세요."
            },
            {
            "bold": "협업 도구 사용",
            "content": "Notion, Slack, Trello와 같은 협업 도구를 사용하여 공동 목표를 관리하고 팀원들과 실시간으로 소통합니다."
            },
            {
            "bold": "짧은 단위로 업무 처리",
            "content": "혼자 장시간 일하는 것을 피하기 위해 1~2시간 단위로 업무를 나누어 집중합니다."
            }
        ],
        "celebrity_example": {
            "name": "엘렌 드제너러스",
            "description": "코미디언이자 TV 쇼 진행자인 엘렌은 사회적 상호작용에서 에너지를 얻으며, 다른 사람들과의 대화에서 아이디어와 동기를 얻습니다. 그녀의 방송 스타일은 팀워크와 사람들과의 소통에 기반을 두고 있습니다.",
            "routine": [
            {
                "bold": "아침 운동",
                "content": "엘렌은 보통 오전 6시에 일어나 가벼운 요가나 스트레칭을 하며 하루를 시작합니다. 몸과 마음을 가볍게 하는 루틴을 통해 에너지를 얻습니다."
            },
            {
                "bold": "팀 미팅",
                "content": "엘렌은 하루 중 많은 시간을 제작진과의 회의, 대본 작성, 팀 미팅에 사용합니다. 다른 사람들과의 협업을 통해 다양한 아이디어를 얻는 것을 선호합니다."
            },
            {
                "bold": "소셜 네트워크 활용",
                "content": "그녀는 사람들과의 소통을 중요시하며, 방송 외에도 소셜 미디어와 다양한 플랫폼을 통해 팬들과 적극적으로 교류합니다."
            },
            {
                "bold": "유머로 스트레스 해소",
                "content": "일정 속에서 스트레스를 피하기 위해 긍정적인 환경을 유지하고, 많은 웃음을 나눌 수 있는 순간을 가집니다."
            }
          ]
        }
      },
      {
        "id": 5,
        "type": "Emotional Type",
        "characteristics": [
            "생산성이 감정 상태에 따라 크게 달라집니다. 스트레스를 받을 때 쉽게 피로해지지만, 기분이 좋을 때는 몰입도가 높습니다.",
            "감정에 민감하며, 감정 조절이 중요한 루틴의 일부입니다."
        ],
        "routine_recommendations": [
            {
            "bold": "명상 및 감정 조절 활동",
            "content": "매일 10~15분간 명상, 깊은 호흡, 짧은 산책을 통해 감정을 안정시킵니다."
            },
            {
            "bold": "유연한 스케줄",
            "content": "자유 시간을 확보하고 우선순위를 변경할 수 있는 구조를 마련하여 감정 상태에 따라 일정을 조정할 수 있도록 합니다."
            },
            {
            "bold": "감정 일기 작성",
            "content": "매일의 감정 상태를 기록하고 그에 따라 작업 패턴을 조정합니다. 어떤 작업이 감정에 따라 더 효과적인지 이해합니다."
            },
            {
            "bold": "자기 보상",
            "content": "기분이 좋지 않을 때도 작은 성취를 통해 긍정적인 감정을 느낄 수 있도록 스스로 보상을 만듭니다."
            }
        ],
        "celebrity_example": {
            "name": "마릴린 먼로",
            "description": "마릴린 먼로는 감정의 기복이 크며, 이는 그녀의 창의성과 일에 큰 영향을 미쳤습니다. 그녀는 감정 에너지가 창작 과정에 어떻게 영향을 미치는지를 보여주는 대표적인 예시입니다.",
            "routine": [
            {
                "bold": "불규칙한 작업 패턴",
                "content": "마릴린 먼로의 작업 리듬은 감정 상태에 따라 달라졌습니다. 기분이 좋을 때는 촬영장에서 열정적으로 일했지만, 감정적으로 힘든 날에는 작업을 멈췄습니다."
            },
            {
                "bold": "자기 관리 시간",
                "content": "그녀는 감정을 다루기 위해 휴식, 명상, 짧은 산책을 소중히 여겼습니다. 이 루틴은 감정적 균형을 찾는 방법이었습니다."
            },
            {
                "bold": "감정을 글로 표현하기",
                "content": "감정의 기복이 심할 때, 일기나 편지를 쓰며 자신의 상태를 글로 표현하여 스트레스를 해소했습니다."
            },
            {
                "bold": "아침 일찍 기상 및 준비",
                "content": "촬영 날에는 아침 일찍 일어나 준비를 시작했지만, 그날의 감정 상태에 따라 일정의 효율성이 달라졌습니다."
            }
          ]
        }
      },
      {
        "id":6,
        "type": "Goal-Oriented Type",
        "characteristics": [
            "명확한 목표가 있을 때 가장 큰 성과를 내지만, 목표가 없을 때는 쉽게 동기부여가 떨어집니다.",
            "명확한 결과에 집중하며, 단계별 목표를 설정하고 그 과정을 통해 성취감을 얻습니다."
        ],
        "routine_recommendations": [
            {
            "bold": "단기 및 장기 목표 설정",
            "content": "일일, 주간, 월간 목표를 명확히 설정하고 시각화하여 관리할 수 있도록 합니다."
            },
            {
            "bold": "작은 성취 축적",
            "content": "큰 목표를 작은 단위로 나누어 점진적으로 달성할 수 있도록 계획합니다. 예를 들어, 6개월 목표를 1개월 단위로 나누고 각 주에 대한 세부 목표를 설정합니다."
            },
            {
            "bold": "보상 시스템 도입",
            "content": "목표를 달성했을 때 스스로 보상을 주어 동기부여를 유지합니다."
            },
            {
            "bold": "성과 평가 시간",
            "content": "일일 또는 주간 평가를 통해 목표가 달성되었는지 확인하고, 달성률에 따라 계획을 수정합니다."
            }
        ],
        "celebrity_example": {
            "name": "일론 머스크",
            "description": "테슬라와 스페이스X의 CEO인 일론 머스크는 장기적인 목표를 설정하고 끊임없이 도전하며 이를 달성하는 데 전념하는 매우 목표 지향적인 사람입니다. 그는 명확한 비전을 가지고 그 목표를 이루기 위해 모든 에너지를 집중하는 대표적인 인물입니다.",
            "routine": [
            {
                "bold": "하루 5시간 이상의 회의",
                "content": "일론 머스크는 하루 대부분을 회의에 할애하며, 각 프로젝트의 진척 상황을 점검하고 모든 팀이 목표를 향해 나아가고 있는지 확인합니다."
            },
            {
                "bold": "시간 단위로 계획된 하루",
                "content": "그는 하루를 5분 단위로 나누어 최대한 많은 일을 처리합니다. 이 시간 관리 방법은 그의 목표 달성에 크게 기여합니다."
            },
            {
                "bold": "주간 목표 재조정",
                "content": "장기 목표를 주간 단위로 나누어 달성 여부를 점검하고 필요할 경우 계획을 수정합니다."
            },
            {
                "bold": "일관된 업무 몰입 시간",
                "content": "업무 외에도 밤 늦게까지 새로운 아이디어를 생각하거나 프로젝트 세부 사항을 점검합니다. 목표를 달성하기 위해 언제든지 일할 준비가 되어 있습니다."
            }
          ]
        }
      }
    ]
}

            
  